# ==========================================
# โจทย์ข้อที่ 3: คำนวณราคาสินค้าตามสถานะสมาชิก
# Input: บรรทัดที่ 1 ราคาสินค้าเต็ม (price), บรรทัดที่ 2 สถานะสมาชิก (is_member: 1 คือเป็นสมาชิก, 0 คือไม่เป็น)
# Output: ราคาสินค้าสุทธิ (หากเป็นสมาชิก ลดทันที 10%)
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
price = float(input("สินค้าราคาเต็ม"))
is_member = int(input("สถานะสมาชิก:"))
net_price = float(input("price"))
discount = float(input(price*10/100))
if is_member ==1:
  print("ราคาสินค้าสุทธิ:, discount")
elif is_member == 0:
  print("ราคาสินค้าสุทธิ:, net_price")
